Autodesk.Revit.DB.Structure.PointLoad.Moment
Returns the three dimensional moment application to the point load.
Remarks: The moment is measured in Feet*Kg / Sec.

Autodesk.Revit.DB.Structure.PointLoad.Force
Returns the three dimensional force applied to the point load.
Remarks: The force is measured in Feet*Kg / Sec.

Autodesk.Revit.DB.Structure.PointLoad.Point
Returns the three dimensional coordinates of point load.
Remarks: The location is measured in decimal feet.